{
    "en": "I know I am a couple of days late, but I could not let your birthday pass without sending my best wishes your way. Wishing you a fantastic year ahead, filled with happiness, success, and prosperity for both you and your family. Your hard work and dedication never go unnoticed, and I truly hope this year brings you well-deserved opportunities, good health, and plenty of joy.\n\nBeyond the incredible food you serve, I sincerely appreciate the kindness, positivity, and great conversations you bring to every interaction. Our shared love for motorcycling has made our conversations even more enjoyable, and I hope everyday for the day you get to ride again.\n\nThough this message is a little late, my appreciation for you and all that you do is always present. I hope your birthday was a wonderful one, and may the year ahead be filled with success, happiness, and smooth roads—both in life and on your motorcycle.\n\nLooking forward to seeing you soon. Wishing you all the best!",
    "ar": "أعلم أنني متأخر ببضعة أيام، لكنني لم أكن لأدع عيد ميلادك يمر دون أن أرسل لك أطيب التمنيات. أتمنى لك عامًا رائعًا مليئًا بالسعادة والنجاح والازدهار لك ولعائلتك. عملك الجاد وتفانيك لا يمران دون تقدير، وأتمنى بصدق أن يجلب لك هذا العام فرصًا عظيمة وصحة جيدة وسعادة غامرة.\n\nإلى جانب الطعام الرائع الذي تقدمه، أقدّر لطفك وإيجابيتك والحوارات الرائعة التي نجريها معًا. حبنا المشترك للدراجات النارية جعل محادثاتنا أكثر متعة، وأتمنى من كل قلبي أن يأتي اليوم الذي تستطيع فيه الركوب مجددًا.\n\nعلى الرغم من أن هذه الرسالة متأخرة قليلًا، إلا أن تقديري لك دائم. آمل أن يكون عيد ميلادك قد كان رائعًا، وأن يكون العام القادم مليئًا بالنجاح والسعادة والطرق الممهدة—ليس فقط في الحياة، ولكن على دراجتك النارية أيضًا.\n\nأتطلع لرؤيتك قريبًا. مع أطيب التمنيات!",
    "ur": "سالگرہ کو بغیر نیک خواہشات کے گزرنے نہیں دے سکتا۔ میں آپ کے لیے ایک شاندار سال کی دعا کرتا ہوں جو خوشی، کامیابی، اور آپ اور آپ کے خاندان کے لیے خوشحالی سے بھرپور ہو۔ آپ کی محنت اور لگن کبھی نظرانداز نہیں کی جاتی، اور میں واقعی امید کرتا ہوں کہ یہ سال آپ کے لیے بہترین مواقع، اچھی صحت، اور بے حد خوشی لے کر آئے۔\n\nشاندار کھانے کے علاوہ، میں آپ کی مہربانی، مثبت سوچ، اور ہر ملاقات میں بہترین گفتگو کی بہت قدر کرتا ہوں۔ ہماری موٹرسائیکلوں سے محبت نے ہماری بات چیت کو اور بھی یادگار بنا دیا ہے، اور میں ہر دن اس لمحے کے لیے دعا گو ہوں جب آپ دوبارہ سواری کر سکیں۔\n\nاگرچہ یہ پیغام کچھ دیر سے ہے، لیکن میرے دل میں آپ کی عزت اور جو کچھ آپ کرتے ہیں اس کے لیے میرا احترام ہمیشہ موجود ہے۔ میں امید کرتا ہوں کہ آپ کی سالگرہ شاندار رہی ہوگی، اور آنے والا سال کامیابی، خوشی، اور ہموار راستوں سے بھرا ہو، نہ صرف زندگی میں بلکہ آپ کی موٹرسائیکل پر بھی۔\n\nآپ سے جلد ملاقات کی امید ہے۔ نیک تمنائیں!",
    "pa": "ਮੈਂ ਜਾਣਦਾ ਹਾਂ ਕਿ ਮੈਂ ਕੁਝ ਦਿਨ ਦੇਰੀ ਨਾਲ ਆਇਆ ਹਾਂ, ਪਰ ਮੈਂ ਨਹੀਂ ਚਾਹੁੰਦਾ ਕਿ ਤੁਹਾਡਾ ਜਨਮ ਦਿਨ ਮੇਰੀਆਂ ਚੰਗੀਆਂ ਸ਼ੁਭਕਾਮਨਾਵਾਂ ਤੋਂ ਬਿਨਾਂ ਲੰਘ ਜਾਵੇ। ਤੁਹਾਨੂੰ ਇੱਕ ਸ਼ਾਨਦਾਰ ਸਾਲ ਦੀ शुभਕਾਮਨਾ ਦਿੰਦਾ ਹਾਂ, ਜੋ ਤੁਹਾਡੇ ਅਤੇ ਤੁਹਾਡੇ ਪਰਿਵਾਰ ਲਈ ਖੁਸ਼ਹਾਲੀ, ਸਫਲਤਾ ਅਤੇ ਬਰਕਤਾਂ ਨਾਲ ਭਰਿਆ ਹੋਵੇ। ਤੁਹਾਡੀ ਮਿਹਨਤ ਅਤੇ ਲਗਨ ਨੂੰ ਕਦੇ ਵੀ ਅਣਡਿੱਠਾ ਨਹੀਂ ਕੀਤਾ ਜਾਂਦਾ, ਅਤੇ ਮੈਂ ਸੱਚਮੁੱਚ ਆਸ ਕਰਦਾ ਹਾਂ ਕਿ ਇਹ ਸਾਲ ਤੁਹਾਡੇ ਲਈ ਵਧੀਆ ਮੌਕੇ, ਚੰਗੀ ਸਿਹਤ, ਅਤੇ ਬੇਅੰਤ ਖੁਸ਼ੀਆਂ ਲਿਆਵੇ। ਵਧੀਆ ਖਾਣਿਆਂ ਤੋਂ ਇਲਾਵਾ, ਮੈਂ ਤੁਹਾਡੀ ਦਿਆਲਤਾ, ਸਕਾਰਾਤਮਕ ਸੋਚ, ਅਤੇ ਬਹੁਤ ਵਧੀਆ ਗੱਲਬਾਤ ਦੀ ਵੀ ਬਹੁਤ ਕਦਰ ਕਰਦਾ ਹਾਂ। ਸਾਡੀ ਮਿਲੀ-ਝੁਲੀ ਮੋਟਰਸਾਈਕਲ ਦੀ ਦਿਲਚਸਪੀ ਸਾਡੇ ਗੱਲਬਾਤ ਨੂੰ ਹੋਰ ਵੀ ਰੁਚਿਕਰ ਬਣਾਉਂਦੀ ਹੈ, ਅਤੇ ਮੈਂ ਹਰ ਰੋਜ਼ ਆਸ ਕਰਦਾ ਹਾਂ ਕਿ ਉਹ ਦਿਨ ਜਲਦੀ ਆਏ ਜਦੋਂ ਤੁਸੀਂ ਮੁੜ ਸਵਾਰੀ ਕਰ ਸਕੋ। ਹਾਲਾਂਕਿ ਇਹ ਸੁਨੇਹਾ ਥੋੜਾ ਜਿਹਾ ਦੇਰੀ ਨਾਲ ਆਇਆ, ਪਰ ਮੇਰੀ ਇੱਜ਼ਤ ਅਤੇ ਕਦਰ ਹਮੇਸ਼ਾਂ ਤੁਹਾਡੇ ਨਾਲ ਹੈ। ਉਮੀਦ ਕਰਦਾ ਹਾਂ ਕਿ ਤੁਹਾਡਾ ਜਨਮ ਦਿਨ ਸ਼ਾਨਦਾਰ ਰਿਹਾ ਹੋਵੇ, ਅਤੇ ਨਵਾਂ ਸਾਲ ਤੁਹਾਨੂੰ ਸਫਲਤਾ, ਖੁਸ਼ਹਾਲੀ ਅਤੇ ਹਮੇਸ਼ਾ ਸਹੀ ਰਾਹਾਂ ‘ਤੇ ਰੱਖੇ—ਨਾ ਕੇਵਲ ਜੀਵਨ ਵਿੱਚ, ਪਰ ਤੁਹਾਡੀ ਮੋਟਰਸਾਈਕਲ ਦੀ ਯਾਤਰਾ ਵਿੱਚ ਵੀ। ਜਲਦੀ ਮਿਲਣ ਦੀ ਉਮੀਦ ਨਾਲ, ਚੰਗੀਆਂ ਸ਼ੁਭਕਾਮਨਾਵਾਂ!",
    "ps": "زه پوهیږم چې زه څو ورځې ناوخته یم، خو ما نه غوښتل چې ستا د زوکړې ورځ دې له نیکو هیلو پرته تیره شي. زه درته یو غوره کال غواړم، ډک له خوښۍ، بریا، او برکتونو ته ستا او ستا کورنۍ ته. ستا سخت کار او ژمنتیا هېڅکله له پامه نه غورځی، او زه ریښتیا امید لرم چې دا کال به درته غوره فرصتونه، ښه روغتیا، او ډېرې خوښۍ راوړي. د خوندورو خوړو تر څنګ، زه ستا مهرباني، مثبت فکر، او ښې خبرې اترې ډېر ارزوم. زموږ ګډ شوق د موټرسایکل ځغلولو لپاره زموږ خبرې نورې هم خوندورې کړې دي، او زه هره ورځ دعا کوم چې هغه ورځ راورسي چې ته بیا سواری وکړای شې. که څه هم دا پیغام لږ ناوخته دی، خو زما قدرداني تل ستا سره ده. هیله لرم چې ستا د زوکړې ورځ غوره وه، او نوی کال دې بریا، خوښۍ، او اسانه لارې راوړي—نه یوازې په ژوند کې، بلکې په موټرسایکل سفر کې هم. هیله لرم ژر به سره ووینو. نیکې هیلې!",
    "bal": "من دو تین روز دیر کنگان، بہ اما من نہ تاگاں کہ تئی سالگیرہ بی نیک حوشکاں گزر بیت۔ من تئی‌ شاندار سال دعا کنگان کہ خوشی، کامیابی ءَ تہ تئی گھر والاںءِ بہ برکتیان پر بیت۔ تئی محنت ءَ تہ تئی وفاداری ہرگز نظرانداز نہ بیت، ءَ من دل ءَ بندیں امید کنگان کہ اِء سال تئی سرہء نیک موقعاں، سہت ءَ خوشحالی آنت۔ من صِرف تئی مزیدار خوراک ءَ نہیں بلکہ تئی مہربانی، مثبت توانائی ءَ تئی زبردست گپ شپ کے بہ زہمت دوستاں۔ ماں تئی سرہ مشترک موٹر سائیکل محبت منیءَ گپ شپ کے ہونک زہمت بخش بوت، ءَ من روز دعا کنگان کہ روچ بیت کہ تاں باز سواری بیت۔ اگرچہ اِء پیغام دو تین روز دیر کنگان، اما منی عزت ءَ محبت ہمیشہ تئی سرہ ءَ۔ امید کنگان کہ تئی سالگیرہ زبردست بیت، ءَ نیا سال تئی سرہ خوشحالی، کامیابی ءَ ہموار راہاں بیت—نہ صرف زندگیءَ، بلکہ تئی موٹر سائیکلءِ سفرءَ۔ تئی سرہ جلد ملاقاتءِ امید ءَ! نیک تمنائیں!",
    "sd": " مان ٿو ڄاڻان ته مان ٻه ٽي ڏينهن دير سان لکي رهيو آھيان، پر مان نه ٿو چاهيان ته تنهنجي سالگره بنا نيڪ خواهشن جي گذري وڃي. توکي ھڪ شاندار سال جي مبارڪ ڏيان ٿو، جيڪو خوشي، ڪاميابي ۽ برڪتن سان ڀريو پيو هجي، تو ۽ تنهنجي خاندان لاءِ. تنهنجي محنت ۽ وفاداري ڪڏهن به نظرانداز نه ڪئي ويندي، ۽ مان اميد ڪريان ٿو ته ھي سال تو لاءِ وڏيون موقعون، سٺي صحت، ۽ گهڻيون خوشيون آڻي. مزيدار کاڌن کان علاوه، مان تنهنجي مهرباني، مثبت سوچ ۽ شاندار گفتگو جي گهڻي قدر ڪريان ٿو. اسان جي گڏيل موٽر سائيڪل سان محبت اسان جون ڳالهيون اڃا به وڌيڪ دلچسپ بڻائي ڇڏيو آهي، ۽ مان هر ڏينهن دعا ڪريان ٿو ته اهو ڏينهن جلد اچي جڏهن تون ٻيهر سواري ڪري سگھين. جيتوڻيڪ هي پيغام ڪجهه دير سان آهي، پر منهنجي عزت ۽ قدر هميشه توسان آهي. اميد آهي ته تنهنجي سالگره شاندار گذري هوندي، ۽ نئون سال تو لاءِ ڪاميابي، خوشي، ۽ هموار رستا آڻي—نه صرف زندگيءَ ۾، پر تنهنجي موٽر سائيڪل جي سفر ۾ به. جلدي ملڻ جي اميد سان، بهترين خواهشون!",
    "skr": "میں کجھ دن لیٹ آں، پر میں نہ چاندے ہاں کہ تہاڈی سالگرہ بغیر نیک خواہشات دے گذر وے۔ میں دعا کراں کہ ایہہ سال تہاڈے تے تہاڈی فیملی دے واستے خوشحالی، کامیابی تے سکون نال بھریا ہووے۔ تہاڈی محنت تے لگن ہمیشہ نظر آندی اے، تے میں امید کراں کہ ایہہ سال تہاڈے واستے وڈے موقعے، چنگی صحت تے بے حساب خوشیاں لے کے آوے۔ مزیدار کھانے توں علاوہ، میں تہاڈی مہربانی، مثبت سوچ تے ہر ملاقات وچ تہاڈی چنگی گپ شپ دی بہت قدر کراں۔ ساڈے وچ موٹر سائیکل دا سانجھا شوق ساڈے گلاں نوں ہور وی دلچسپ بنا دیندا اے، تے میں ہمیشہ دعا کراں کہ اوہ دن جلدی آوے جدوں تسی فیر سواری کر سکو۔ اگرچہ ایہہ پیغام کجھ دن لیٹ اے، پر میری قدر تے عزت ہمیشہ تہاڈے نال اے۔ امید اے کہ تہاڈی سالگرہ شاندار گذری ہووے، تے ایہہ نواں سال تہاڈے واستے خوشیاں، کامیابی تے ہموار راہواں لیاوے—ناں صرف زندگی وچ، بلکہ تہاڈی موٹر سائیکل دے سفر وچ وی۔ جلدی ملاقات دی امید نال، نیک تمنائیں!",
    "hno": "میں کج دن لیٹ آں، پر میں نئیں چاندہ کہ تہانڑی سالگرہ بغیر نیک خواہشات دے گزر جائے۔ میں تہانڑے لئی اک کمال دے سال دی دعا کراں، جیہڑا خوشی، کامیابی تے تہانڑی فیملی واسطے برکتاں نال بھریا ہووے۔ تہانڑی محنت تے لگن کدی وی نظرانداز نئیں تھیندی، تے میں سچ دے نال امید کراں کہ ایہہ سال تہانڑے واسطے ودھیا موقعے، وڈی صحت تے خوشیاں لے کے آوے۔ مزیدار کھانے دے علاوہ، میں تہانڑی مہربانی، مثبت سوچ تے ہر ملاقات وچ شاندار گل بات دی بڑی قدر کراں۔ ساڈے وچ موٹر سائیکل دا سانجھا شوق ساڈے گلاں نوں ہور وی چنگا بنا دیندا اے، تے میں ہر روز دعا کراں کہ اوہ دن فیر آوے جدوں تسی دوبارہ سواری کر سکو۔ ایہہ پیغام ہلے تھوڑا لیٹ ضرور اے، پر میری عزت تے قدر ہمیشہ تہانڑے واسطے موجود اے۔ امید اے کہ تہانڑی سالگرہ کمال دی ہوئی ہووے، تے ایہہ نواں سال تہانڑے لئی کامیابی، خوشی، تے ہموار راہواں لیاوے—نہ صرف زندگی وچ بلکہ تہانڑی موٹر سائیکل دے سفر وچ وی۔ جلدی ملاقات دی امید نال، نیک خواہشات!",
    "es": "Sé que llego con un par de días de retraso, pero no podía dejar pasar tu cumpleaños sin enviarte mis mejores deseos. Te deseo un año fantástico, lleno de felicidad, éxito y prosperidad para ti y tu familia. Tu arduo trabajo y dedicación nunca pasan desapercibidos, y realmente espero que este año te traiga grandes oportunidades, buena salud y mucha alegría.\n\nMás allá de la increíble comida que preparas, valoro sinceramente tu amabilidad, energía positiva y las buenas conversaciones que siempre tenemos. Nuestro amor compartido por las motocicletas hace que nuestras charlas sean aún más especiales, y espero cada día que llegue el momento en que puedas volver a montar.\n\nAunque este mensaje llega un poco tarde, mi aprecio por ti y por todo lo que haces siempre está presente. Espero que hayas tenido un cumpleaños maravilloso y que este nuevo año te traiga éxito, felicidad y caminos despejados—tanto en la vida como en tu motocicleta.\n\nEspero verte pronto. ¡Mis mejores deseos!"
}
